---
layout: post
title: Чек-лист хороших инженерных практик в компаниях
subtitle:
summary: Подходы к тестированию, развертыванию, разработке и процессам
cover_url: "Путь к файлу-обложке для соц. сетей, например, /images/vscode_eslint.png"
---

Разработка программного обеспечения нетривиальный процесс, который имеет тенденцию значительно усложняться с ростом количества участников. Больше людей в команде - большего числа коммуникаций и необходимости синхронизироваться (обмениваться знаниями о частях системы и происходящих процессах, следить за бизнесом и его требованиями). Растет цена ошибки, система перестает умещаться в голове одного разработчика, изменения в одном месте влияют на изменения в других местах. В этих условиях, разные команды проявляют себя по разному, некоторые продолжают поддерживать высокий темп разработки и регулярно выпускают новые версии, у других происходит сильное замедление, переговоры отнимают больше времени чем разработка, качество падает, выпуск новой версии становится стрессом и приключением. Общая скорость внедрения новых фич в таких командах может различаться во много раз и даже на порядок.

Причин такой катастрофической разницы довольно много. Вот некоторые из них:

* Ошибки топ-менеджмента в бизнесе. Если бизнес делает не то что надо, то не важно насколько эффективно он делает не то что надо, в конце концов бизнес закроется. Эта тема выходит за рамки текущего гайда.
* Ошибки топ-менеджмента в области процессов. Если на этом уровне все плохо, то все остальное вторично. Даже неверная система бонусов может привести к разладу в команде и полной блокировке разработки в конечном счете.
* Человеческий фактор. Личные качества и человеческие пороки могут создать проблемы как и остальным членам команды, так и всему проекту в целом. Главная проблема в том, что эту часть невозможно выправить никакими процессами. Только изменение поведения, либо расставание.
* Плохой процесс разработки. Эта тема касается всех инженеров без исключения. Сюда входит все начиная от взаимодействия и работы с задачами, заканчивая тестированием и проведением ревью кода.

На некоторые проблемы повлиять либо сложно либо невозможно, но другие, особенно относящиеся к инженерным практикам, нужно постоянно улучшать и менять. Программисты должны принимать в этом самое активное участие.

* [Книги](https://ru.hexlet.io/pages/recommended-books)
    * Человеческий фактор. Успешные проекты и команды
    * Мифический человеко-месяц, или Как создаются программные системы
    * Идеальный программист. Как стать профессионалом разработки ПО
    * Цель. Процесс непрерывного совершенствования
* [Что такое DevOps?](https://ru.atlassian.com/devops)
* [Экстремальное программирование](https://ru.wikipedia.org/wiki/Экстремальное_программирование)
* [12factors](https://12factor.net/ru/)
* [Manifesto for Agile Software Development](http://agilemanifesto.org/iso/ru/manifesto.html)
* [Bus Factor](https://en.wikipedia.org/wiki/Bus_factor)
* [Карго культ](https://ru.wikipedia.org/wiki/%D0%9A%D0%B0%D1%80%D0%B3%D0%BE-%D0%BA%D1%83%D0%BB%D1%8C%D1%82).
* [Инжиниринг в букинге](https://bronevichok.ru/blog/2015/04/26/engineering-at-booking.com.html)
* [Формирование инженерной культуры](https://www.youtube.com/watch?v=W7GlELjRODw)
* [Как распространять инженерную культуру в своей компании](https://www.youtube.com/watch?v=mOfiWrTW9dA)

И хотя практик довольно много, все они, сводятся к нескольким простым вещам. Дать возможность команде ...

Ниже приводится чек-лист, который позволяет понять, используются ли в команде те инженерные практики, которые считаются наиболее удачными.

_Соответствие этим практикам не означает то что в компании все хорошо. Возможно это культ-карго либо процессы формализованы настолько, что больше мешают чем помогают. С другой стороны из каждого правила есть исключения и всегда найдется проект где что-то не применимо. Ну и наконец, некоторые из указанных подходов могут идти в разрез с чьими-то ценностями._

### Код

**Хорошо**

* [CVS](https://ru.wikipedia.org/wiki/CVS). Код находится под контролем версий (как правило гит).
* [Общий код](https://ru.wikipedia.org/wiki/%D0%AD%D0%BA%D1%81%D1%82%D1%80%D0%B5%D0%BC%D0%B0%D0%BB%D1%8C%D0%BD%D0%BE%D0%B5_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5#%D0%9A%D0%BE%D0%BB%D0%BB%D0%B5%D0%BA%D1%82%D0%B8%D0%B2%D0%BD%D0%BE%D0%B5_%D0%B2%D0%BB%D0%B0%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5). Любой член команды, в любой момент времени, может изменить любую часть системы.
* [Единый стиль кода](https://ru.wikipedia.org/wiki/%D0%AD%D0%BA%D1%81%D1%82%D1%80%D0%B5%D0%BC%D0%B0%D0%BB%D1%8C%D0%BD%D0%BE%D0%B5_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5#%D0%A1%D1%82%D0%B0%D0%BD%D0%B4%D0%B0%D1%80%D1%82%D1%8B_%D0%BE%D1%84%D0%BE%D1%80%D0%BC%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F_%D0%BA%D0%BE%D0%B4%D0%B0). В команде все придерживаются стандартов кодирования, принятых для данного стека (языка, платформы).

**Плохо**

* Каждый пишет код в том стиле, в котором он привык. Нет общих стандартов либо есть, но свой, совершенно отдельный от общепринятого.
* Не используется контроль версий
* Программисты защищают свой участок кода от посягательства других участников

### Среда разработки

**Хорошо**

* Разработка ведется в специальной development (dev) среде, как правило это локальная машина (возможно с использованием Vagrant или Docker).
* У каждого разработчика своя, независящая от других среда разработки.
* Разворачивание среды автоматизировано и происходит "одной кнопкой".
* Среда разработки максимально приближена к условиям продакшена. Если сервис работает на Linux, то и разработка ведется в Linux. Тоже самое касается и других аспектов.

**Плохо**

* Код правится прямо на продакшене (то место где он работает)
* Разворачивание среды и настройка происходит по мануалам, либо методом "попрообовал запустить - прочитал сообщение об ошибке - погуглил - исправил".
* Общая база данных для всех разработчиков

### Качество

**Хорошо**

* Кодовая база покрыта тестами.
* Тесты часть фич, фича без тестов не считается выполненой
* Программист отвечает за фичу до самого конца. Фича считается выполненой только когда она работает на продакшене.
* Команда ревьювит код друг друга.
* [Парное программирование](https://ru.wikipedia.org/wiki/%D0%9F%D0%B0%D1%80%D0%BD%D0%BE%D0%B5_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5)
* [CI](https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%BF%D1%80%D0%B5%D1%80%D1%8B%D0%B2%D0%BD%D0%B0%D1%8F_%D0%B8%D0%BD%D1%82%D0%B5%D0%B3%D1%80%D0%B0%D1%86%D0%B8%D1%8F). Репозитории проекта подключены к серверу непрерывной интеграции на котором, после каждого коммита, проверяется стиль кодирования (через запуск линтеров), прогоняются тесты, осуществляется сборка проекта (например компиляция).
* В случае инцендентов проводятся [пост мортемы](https://www.pagerduty.com/resources/learn/post-mortem-incident-report/).
* [Ретроспектива](https://ru.wikipedia.org/wiki/%D0%A0%D0%B5%D1%82%D1%80%D0%BE%D1%81%D0%BF%D0%B5%D0%BA%D1%82%D0%B8%D0%B2%D0%B0_%D0%B2_%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B8). Процесс непрерывно улучшается и на изменения влияет каждый член команды.

**Плохо**

* Нет тестов.
* Отсутствует код ревью.
* Работа нового кода провреяется только ручным способом, через прокликивание.
* Программист считает что фича закрыта когда код попал в основную ветку.
* [KPI](https://ru.wikipedia.org/wiki/%D0%9A%D0%BB%D1%8E%D1%87%D0%B5%D0%B2%D1%8B%D0%B5_%D0%BF%D0%BE%D0%BA%D0%B0%D0%B7%D0%B0%D1%82%D0%B5%D0%BB%D0%B8_%D1%8D%D1%84%D1%84%D0%B5%D0%BA%D1%82%D0%B8%D0%B2%D0%BD%D0%BE%D1%81%D1%82%D0%B8). Активно используются количественные метрики: строки кода, выпущенные фичи, закрытые баги.
* Высокий уровень формализации процессов.

### Процесс разработки

**Хорошо**

* Разработчики руководствуются принципами [12factors](https://12factor.net/ru/)
* Тесты писать легко и приятно.
* Запуск одного теста выполняется за доли секунды.
* [TDD](https://ru.wikipedia.org/wiki/TDD). По возможности тесты пишутся до кода
* Перед починкой бага, сначала пишется тест который его воспроизводит, затем происходит исправление.

**Плохо**

* Тесты есть, но приходится заставлять себя писать тесты, потому что их сложно писать, они долго выполняются, часто ломаются или постоянно приходится их переписывать.
* Запуск одного теста занимает секунды.

### Выкатка новых версий (более актуально для веб-проектов)

Продакшен - среда (инфраструктура, например сервера) в которой развернут проект. Она обеспечивает доступ к проекту конечным пользователям.
Деплой (выкатка) - процесс в рамках которого происходит обновление проекта в продакшен среде.

**Хорошо**

* Автоматизация. Развертывание автоматизировано и выполняется одной кнопкой.
* Частые небольшие релизы. Развертывание - рядовое событие, которое может выполняться в любой момент по готовности фич без необходимости отвлекать команду.
 Zero Downtime Deploy. Обновление версии происходит прозрачно для пользователей.
* Развертывание может выполнить любой член команды.

**Плохо**

* Выкладка происходит в ручном режиме, через прямое управление с сервера.
* Выкладка кода это событие, сопровождающееся эмоциональным напряжением и вовлечением большого числа участников.
* Процесс развертывания длится десятки минут или часы.
* Разворачивание происходит раз в неделю и реже.
* Во время разворачивания наблюдаются длительные даунтаймы.
* Развертывание выполняет один специальный человек.
* Обновление конфигурации не относящейся напрямую к логике кода требует повторного деплоя. Например изменение пароля к базе данных или адреса базы.

---

*Кирилл Мокевнин (и сообщество Хекслета)*
